Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: tm/Ibrahim_Compliance-level1.tmx
Source language: en_us
Languages: ja

source: MeeGo combines Intel's Moblin(TM) and Nokia's Maemo projects into one Linux-based platform.
ja: MeeGo は、Intel 社の Moblin(TM) プロジェクトと Nokia 社の Maemo プロジェクトを 1 つに組み合わせた Linux ベースのプラットフォームです。

source: You may want to follow through the sections with your own computer to gain hands-on experience using OBS.
ja: 読者の方は、自分のコンピューターで、実際に OBS を使用してみたいと思うでしょう。

source: - Open Compliance Program: http://www.linuxfoundation.org/programs/legal/compliance
ja: オープン コンプライアンス プログラム: http://www.linuxfoundation.jp/programs/legal/compliance

source: Figure 2 illustrates the OBS architecture.
ja: 図 2 は OBS のアーキテクチャを表しています。

source: Pre-Distribution Verifications Phase
ja: 配布前検証フェーズ

source: For more information on the concept of license compatibility, please refer to http://www.fsf.org/licensing/licenses/
ja: ライセンス互換性の概念の詳細については、http://www.fsf.org/licensing/licenses/ を参照してください。

source: The SPDX Group is part of FOSSBazaar (a Linux Foundation working group) and encourages participation by anyone interested.
ja: SPDX ワークグループは、BOSSBazaar (The Linux Foundation のワークグループの 1 つ) の一部で、だれでも参加することができます。

source: - Provide legal guidance
ja: 法的なアドバイスを行う

source: Identifying all software planned for inclusion in the product
ja: 製品に含める予定のすべてのソフトウェアを特定する

source: Half-day training, for executive management, focusing on the importance of compliance and what must be done to satisfy open source license obligations.
ja: 役員レベルの管理者層のための半日トレーニング。コンプライアンスの重要性、およびオープン ソース ライセンス義務を果たすために行うべきことに焦点を絞っています。

source: d)Compliance resources are assigned.
ja: ｄ) コンプライアンス要員が割り当てられている。

source: Prior to Canonical she managed the team doing the open source development for the Power architecture at Freescale Semiconductor, Inc. for the last 10 years.
ja: Canonical 入社前の 10 年間は、Freecale Semiconductor 社において、Power アーキテクチャのためのオープン ソースを開発するチームを指揮していました。

source: - Prepare FOSS packages for distribution
ja: 配布用の FOSS パッケージを準備する

source: - Auditing personnel
ja: 監査担当者

source: Legal Department
ja: 法務部門

source: Code Janitor Tool Overview
ja: コード管理ツール (Code Janitor Tool) (英語)

source: Audits on the source code
ja: ソース コードを監査する

source: Some of the recommended practices in this area include:
ja: ここでの推奨プラクティスには、次のようなものがあります。

source: The embedded Linux ecosystem is very broad and somewhat fragmented.
ja: 組込み Linux のエコシステムは非常に広範で、やや分断化されており、

source: Self-Assessment Checklist
ja: 自己診断チェックリスト

source: The course also discusses the scope of a compliance program and approaches to organizing and managing the compliance function, including skillsets, staffing, and computing assets needed to accomplish the compliance effort.
ja: また、コンプライアンス プログラムの範囲について、さらにコンプライアンス機能を編成および管理するためのアプローチ、たとえば、コンプライアンス活動を行うために必要なスキルセット、人材、コンピューター資産などについても解説します。

source: b)Compliance project priorities are set.
ja: b) コンプライアンス プロジェクトの優先順位が設定されている。

source: Prepare Source Code Packages for Distribution
ja: 配布用の ソース コード パッケージを準備する

source: The goals of the audit are to:
ja: この監査には、次のような目的があります。

source: Resolve IP Issues Associated With the Use of FOSS
ja: FOSS の使用に伴う知財問題の解決

source: Download Open Compliance Data Sheet
ja: オープン コンプライアンス データ シートをダウンロードする

source: The software build process must yield the exact same results every time independent of who executes it.
ja: ソフトウェアのビルド プロセスは、誰が実行しても、毎回必ず、全く同じ結果を得られなければなりません。

source: How UEFI Secure Boot is Designed to Work
ja: UEFI Secure Boot のしくみ

source: It allows providing solutions to discovered problem within acceptable timeframe.
ja: 発見された問題の解決策を受容可能な時間内に提供できる。

source: b)The OSRB maintains accurate records about its reviews and review outcomes, including any limitations or conditions on approval that might necessitate a different outcome in another context.
ja: b) OSRB は、その調査と調査結果に関する正確な記録を保持する。たとえば、状況によっては異なる結果になりうる承認の制約や条件なども含める。

source: By examining these cases, we can extract the following lessons:
ja: これらの例を検証すると、次のような教訓を得ることができます。

source: In addition, most licenses require that the license text be made available to software recipients so they’re aware of the freedoms they’re entitled to.
ja: また、多くのライセンスは、ソフトウェア受領者が自分に与えられている自由について認識できるように、彼らにソフトウェアのライセンス文書を参照できるようにすることを求めています。

source: (Multiple Vendors)
ja: (複数のベンダー)

source: The build scripts needed to compile the source code.
ja: ソース コードをコンパイルするために必要なビルド情報。

source: A compliance project management tool to manage the compliance project, track tasks and resources
ja: コンプライアンス プロジェクトの管理、コンプライアンスに関わるタスクおよびリソースの追跡を行うためのコンプライアンス プロジェクト管理ツール

source: Several failure and consequently to the failure of complying with the FOSS license obligations, for instance, in regard to:
ja: コンプライアンス違反の例、および FOSS のライセンス義務の違反につながった例に基づき、注意するべきことをいくつか挙げてみましょう。

source: Product Management, Project Management, and Process Management
ja: 製品管理、プロジェクト管理、プロセス管理

source: The analyzed bz2 compressed file contains files with 32 different licenses.
ja: 解析された bz2 圧縮ファイルには、32 種類のライセンスを持つファイルが含まれています。

source: Compliance The Basics You Must Know
ja: コンプライアンス 基本概念

source: This is an unofficial translation of the GNU General Public License into language.
ja: This is an unofficial translation of the GNU General Public License into language. (これは GNU General Public License の非公式な language 翻訳版です。)

source: The engineering and product teams decide what external software to bring into the product baseline, including third party and FOSS.
ja: エンジニアリング/プロダクト チームは、サードバーティ ソフトウェアや FOSS の中から、製品のベースラインに使用する外部ソフトウェアを決定します。

source: As part of putting the compliance program in place, you will need to mandate some simple rules that everyone must follow, such as:
ja: コンプライアンス プログラムの導入する際、誰もが守らなければならないシンプルなルールを決める必要があります。たとえば、次のようなものがあります。

source: Portable Application Development for MeeGo Devices
ja: Portable Application Development for MeeGo Devices (MeeGo デバイス向けのポータブル アプリケーション開発)

source: Each of these steps can further be decomposed into a series of more granular operations which is dependent on the particular entity processed by the step.
ja: 各ステップには、さらに詳細な一連の手順が含まれますが、これらはステップごとに処理されるエンティティに依存します。

source: Scanning4 the source code for possible matches with FOSS source code.
ja: ソース コードをスキャン4することによって、FOSS ソース コードと一致していないか確認する。

source: Existing modules include license analysis, meta data extraction, and MIME type identification.
ja: 既存のモジュールとして、ライセンス分析、メタデータ抽出、MIME タイプ識別などがあります。

source: Core Compliance
ja: コア コンプライアンス

source: The Linux Foundation's Open Compliance Program is the industry's only neutral, comprehensive software compliance initiative.
ja: The Linux Foundation のオープン コンプライアンス プログラムは、業界唯一の中立かつ包括的なソフトウェア コンプライアンス戦略です。

source: In the scenario above, the KEK used to boot the operating system is still controlled by the producer of the operating system, as envisaged by the UEFI specification.
ja: この時点では、OS をブートするために使用される鍵交換鍵は、UEFI 仕様にあるように、その OS の作者によって管理されています。

source: Scale the build system as the requirements of the organization grow.
ja: 組織の要件の成長に応じて、ビルド システムを調整する。

source: The Linux Foundation's Legal Programs provide a neutral place for the legal community to collaborate and protect the Linux platform.
ja: The Linux Foundation のリーガル プログラムは、リーガル コミュニティが協力し、Linux プラットフォームを保護するための中立な場を提供します。

source: The OSRB communicates perspectives across business units to achieve a consistency of interpretation of license obligations and review practices.
ja: ◆OSRB はあらゆる事業体と見解をやりとりし、ライセンス義務と調査プラクティスに関する解釈の一貫性を図ること。

source: Add a milestone in the compliance process to verify that modified source code has been marked as such.
ja: コンプライアンス プロセスに確認ポイントを追加し、変更されたソース コードが適切に記録されているかどうか検証する。

source: It is virtually impossible to act in that way and still not infringe the original copyright.
ja: このような行動はあってはならないことですが、それでもまだオリジナルの著作権を侵害しているわけではありません。

source: Distribution
ja: 配布

source: Dependency Checker, capable of identifying code combinations at the dynamic and static link level.
ja: 動的および静的リンクレベルでコードの組み合わせを識別できる依存状態チェッカー (Dependency Checker) ツール。

source: Use clear language in the written offer and be inclusive of all FOSS included in the product.
ja: 書面によるオファー (written offer) にはわかりやすい表現を使用し、製品に組み込まれているすべての FOSS を含めます。

source: Creating a compliance program while achieving the right balance between processes and product ship deadlines
ja: プロセス間のバランスを保ち、製品出荷日に間に合うよう、コンプライアンス プログラムを作成する

source: All engineers must take the available FOSS training.
ja: すべてのエンジニアは、利用可能な FOSS トレーニングを受講する必要があります。

source: We discussed this topic in an earlier paper.
ja: このトピックについては、以前のホワイトペーパーで説明しました。

source: Green (Good) / Yellow (Marginal) / Red (Unacceptable)
ja: 緑 (良好) / 黄 (要注意) /赤 (容認できない) ◆◆

source: - Perform architecture review to analyze the interaction between the FOSS source code, proprietary code and third party source code.
ja: - FOSS、プロプライエタリ、およびサードパーティのソース コード間の相互関係を解析するためのアーキテクチャ レビューを行います。

source: Failure to resolve the audit findings:
ja: 監査結果の未解決:

source: Different from other mobile platforms, MeeGo is open source and includes the core operating system, user interface libraries and tools, reference user experiences for multiples devices and applications, a standard set of APIs across all target device types.
ja: MeeGo が他のモバイル プラットフォームと異なる点は、オープン ソースであること、およびコアの OS、ユーザー インタフェース ライブラリやツール、さまざまなデバイスやアプリケーションのためのリファレンス ユーザー エクスペリエンス、すべてのターゲット デバイス タイプに対応可能な標準 API セットを備えている点です。

source: Company to take necessary action to become compliant
ja: 企業はコンプライアンスのために必要な行動をとること

source: OBS combines many features that make it a universal tool for building and working with Linux distributions.
ja: OBS は、Linux ディストリビューションを構築および処理するさまざまな汎用ツールの機能を結合しています。

source: Perform architectural reviews to verify if and how FOSS license obligations are extending to proprietary and 3rd party software components
ja: アーキテクチャをレビューし、FOSS のライセンス義務がどのようにプロプライエタリおよびサード パーティのソフトウェア コンポーネントに及んでいるか確認する

source: Provide adequate resources to the OSRB to ensure that the compliance activities do not fall behind the development activities
ja: OSRB に適切なリソースを提供し、コンプライアンス活動が開発活動に遅れることがないようにする。

source: The origin of some of the components may not be clear
ja: 開発元が不明なコンポーネントが存在する場合もある

source: Basic training on the organization's OSS policy and on the benefits of OSS use is provided to all who come into contact with OSS or are involved in customer and supplier interactions and in product distribution activities.
ja: 組織の OSS ポリシー、および OSS 利用のメリットに関する基本的トレーニングを、OSS に関わるすべての人々、あるいは顧客やサプライヤーとの対話や製品配布業務に関わるすべての人々に提供する。

source: Possible damage to brand, reputation, and credibility
ja: ブランド イメージ、名声、および信頼性の低下

source: The Frontend
ja: フロントエンド

source: Warden
ja: 管理者

source: The source code is published on the web site.
ja: ソース コードが Web サイトで公開されている。

source: As the open source ecosystem continues to evolve with new opportunities and risks, this community will focus discussion on how the industry can best adapt to the changes.
ja: OSS エコシステムは新たな可能性とリスクを包含し進化し続けています。このコミュニティでは、業界はいかにしてこうした進化/変化に対応していくべきかを協議します。

source: Integration
ja: 統合

source: Getting a MeeGo.com Account http://meego.com/user/register
ja: MeeGo.com アカウントの入手: http://meego.com/user/register

source: Audience
ja: 対象者

source: Facilitating effective usage of FOSS in commercial products within the company
ja: 社内で、商品への効果的な FOSS 利用を促進する

source: Their primary responsibility from a compliance perspective is to submit complete OSRB usage forms for any FOSS that is planned for inclusion in a product.
ja: コンプライアンスにおける彼らの基本的な責任は、製品に含む予定のすべての FOSS について、OSRB 指定の使用申請書に適切に記入し、提出することです。

source: The OSRB is responsible for developing and offering FOSS and compliance training to ensure that:
ja: OSRB は FOSS とコンプライアンス トレーニングを開発および提供することにより、以下を保証する責任を負います。

source: The Scheduler Service
ja: スケジューラー サービス

source: Company to publish licensing notice on their website
ja: 企業は、ライセンス告知を企業の Web サイトで公開する

source: It allows very efficient processing of incremental scans.
ja: インクリメンタル スキャンで効率を上げることができる。

source: A bill of materials is prepared to reflect the open source content of a specific product release.
ja: 各製品リリースのオープン ソース コンテンツを反映する BoM (構成表) を用意している。

source: Operating System
ja: オペレーティング システム

source: A large and growing pool of applications is available under open source licenses, but open source code is most pervasive in components embedded in almost any application developed today.
ja: 成長する大きなアプリケーションの一群は、オープン ソース ライセンスのもとで利用することができますが、現在開発されているほとんどのアプリケーションのコンポーネントにも、オープン ソースのコードが使われています。

source: End-to-End Compliance Process
ja: 詳細なコンプライアンス プロセス

source: The API can be accessed via two routes:
ja: API は、以下の 2 つのルートでアクセスできます。

source: Examples include organizational procedures; tools; OSS licenses; software architectural guidelines; etc.
ja: たとえば、組織の手続き、ツール、OSS ライセンス、ソフトウェアの設計ガイドラインなどがこれに含まれる。

source: Compliance contributors are drawn from cross-functional departments, as needed.
ja: 必要に応じ、クロスファンクショナルな部門からコンプライアンス作業貢献者を選出する。

source: Failure to provide the right source code version:
ja: 間違ったソース コード バージョンの配布 (正しいソース コード バージョン配布の違反):

source: While there are many commercial and open source scanning tools available to identify the origin and license of source code, the Linux Foundation has developed complementary tools needed to help companies improve their open source compliance due diligence.
ja: ソースコードに含まれるライセンスを確認するための商用、またはオープンソースのツールはすでにありますが、今回 LF では、これらの既存ツールを補完する機能を持ち、オープン ソース コンプライアンス精査を支援するツールを開発しました。

source: Bob Gobeille works for the Open Source Program Office at Hewlett Packard.
ja: Bob Gobeille は、Hewlett Packard 社の Open Source Program Office に在籍しており、

source: Implementation and Management of Open Source Compliance
ja: オープン ソース コンプライアンスの実装と管理 (英語)

source: One way to enforce the compliance program is to integrate it within the software development process and ensure that a certain percentage of the employees' performance evaluation depends on how well they are committed to FOSS compliance.
ja: コンプライアンス プログラムを徹底する 1 つの方法として、コンプライアンス プログラムをソフトウェア開発プロセスに統合し、さらには、従業員の業績評価の一定割合を FOSS コンプライアンスへの取り組み方に充てる、というものがあります。

source: All personnel involved in the development, quality assurance, release and maintenance of software need to understand the compliance program.
ja: ソフトウェアの開発、品質保証、リリース、およびメンテナンスに関わるすべての社員は、そのコンプライアンス プログラムについて理解する必要があります。

source: If a company is considering an acquisition, it should structure its compliance program so that it can offer a level of disclosure and representations that will be requested by the acquirer.
ja: 買収を考慮に入れている場合は、買収側が要求するレベルの情報開示義務を提示できるように、コンプライアンス プログラムを構成する必要があります。

source: For Users
ja: ユーザー向け

source: Attaining the goals of the SPDX Working Group will be especially important for consumer electronics manufacturers who assemble parts from a variety of suppliers into their shipping products.
ja: SPDX ワーキング グループの目的を果たすことは、さまざまなサプライヤーの部品を製品に組み込む家電メーカーにとって、特に重要になります。

source: The Open Source Compliance training course will be available starting 09/01/2010.
ja: オープン ソース コンプライアンス トレーニング コースは、2010 年 9 月 1 日開始です。

source: All pre-distribution verification have been checked and no issue is discovered.
ja: 配布前の検証がすべてチェックされ、何も問題が検出されない。

source: OBS builds and integrates packages for multiple distributions and versions of distributions at the same time.
ja: OBS は、複数のディストリビューションやバージョンに対応するパッケージを同時にビルドおよび統合できます。

source: Tools available to assist compliance activities
ja: コンプライアンス活動に役立つツール

source: The tool provides a number of features and capabilities and can be used as a platform to innovate and enable easy compliance.
ja: このツールには、さまざまな機能があるため、コンプライアンスの容易な履行を実現するプラットフォームとして利用できます。

source: This continuous integration workflow avoids inconsistencies and diversion from the beginning.
ja: この継続的な統合ワークフローにより、初期から一貫性が保たれ、逸脱が回避されます。

source: However, an open platform owner still has the right to modify the platform and expect it to boot.
ja: しかしながら、プラットフォーム オーナーには、プラットフォームを変更て、それをブートさせる権限があります。

source: Therefore, the industry needs a standard way of referring to the legal compliance ‘bill-of-materials’ of a software package.
ja: したがって、業界は、ソフトウェア パッケージの法的順守の目的にかなった BoM を参照する共通の方法を必要としています。

source: a)Individuals performing compliance functions in different business units are encouraged to communicate and share expertise and perspectives amongst themselves to achieve a consistent compliance approach.
ja: 異なる事業体でコンプライアンスの任務を実行している関係者は、専門知識や見識を相互に交換および共有して、一貫性のあるコンプライアンス アプローチを実現するよう奨励されている。

source: There is no binary - source package matching.
ja: バイナリとソース パッケージを照合する機能がない。

source: c)Skilled and knowledgeable individuals write the OSS-relevant sections of product documentation and satisfy the other license obligations that must be met.
ja: c) スキルと知識を持つ担当者が、製品ドキュメントの OSS 関連のセクションを記述し、果たすべきその他のライセンス義務を履行する。

source: b)Metrics are routinely collected and reported on response time.
ja: b) メトリクスが定期的に収集され、応答時間が報告される。

source: Parallel build with dependency management on build farms or computers with multiple processors or processor cores.
ja: 複数のプロセッサやプロセッサ コアを持つビルド ファーム/ビルド コンピューターにおいて、依存関係を管理しつつ並列ビルドを行う。

source: a)A defined format is used to record information about the OSS included.
ja: a) 定義されている書式を使用して、含まれている OSS の情報を記録する。

source: b)Training records are maintained.
ja: b) トレーニングの記録を保持する。

source: Some companies issue a company-wide FOSS newsletter periodically that focuses on compliance and news around FOSS.
ja: FOSS 関連のコンプライアンスやニュースにフォーカスした全社向けの FOSS ニュースレターを定期的に発行している企業もある。

source: This checklist is called “Self-Assessment” because organizations can use it internally without any help from any third party and without exposing their internal compliance practices to anyone.
ja: このチェックリストは、企業がサード パーティの助けを借りたり、社内のコンプライアンス事例を公表したりすることなく、社内で使用できるため、自己診断チェックリストと呼ばれます。

source: Components that use shared header files
ja: 共有ヘッダー ファイルを使用するコンポーネント

source: Build service builds and local builds are always performed within chroot environment avoiding any issues with different system configurations.
ja: ビルド サービスのビルドとローカル ビルドは、常に chroot 環境で実行されることで、システム構成の違いによる問題が回避されます。

source: The Linux Foundation has also published a number of white papers on compliance, available at http://www.linuxfoundation.org/programs/legal/compliance/training-and-education, including
ja: The Linux Foundation から、コンプライアンスに関するホワイト ペーパーも提供されています。これらは、下記のサイトから入手できます。 http://www.linuxfoundation.org/programs/legal/compliance/training-and-education たとえば、以下のようなホワイト ペーパーがあります。

source: Prerequisites Outcome
ja: 前提 成果

source: Investigate
ja: 調査

source: Open source Bill of Material
ja: オープン ソースの BoM (部品構成表)

source: (3rd Party Commercial, Proprietary, FOSS)
ja: (サード パーティ 商用、プロプライエタリ、FOSS)

source: Getting Involved with MeeGo
ja: MeeGo ◆

source: OSS discovery occurs at an early point in the product development cycle.
ja: 製品開発サイクルの早期段階で OSS 検出を行うこと。

source: Learn More
ja: 詳細情報 (英語)

source: SFLC's "A Practical Guide to GPL Compliance"
ja: SFLC の「GPL コンプライアンスへの実用的ガイド」(英語)

source: A resolution for each of the flagged files in the report and a resolution for any flagged license conflict.
ja: レポートで警告された各ファイルに関する問題の解決、および警告されたすべてのライセンス違反の解決。

source: Permissive licenses like BSD and MIT make it easy; software can be redistributed and developers can modify code without the requirement of making changes publicly available.
ja: BSD や MIT のような寛容なライセンスの場合は簡単です。ソフトウェアを再配布でき、開発者は、コードを改変しても、その改変を一般に公開する必要はありません。

source: Verification concerns the independent assurance steps taken by the OSS compliance team to confirm that OSS obligations have been properly met.
ja: 「検証」は、OSS に関する義務が正しく履行されていることを確認するために、OSS コンプライアンス チームによって実行される独立した保証措置です。◆◆

source: Once you receive the compliance inquiry, you should reply informing the inquirer that you have received their email and that you will look into it and get back to them in a timely fashion.
ja: コンプライアンスに関する照会を受けたら、電子メールの照会者に返信し、「調査の後速やかに回答する」旨を伝える必要があります。

source: An effective compliance process will include several steps (Figure 1):
ja: 効果的なコンプライアンス プロセスには、いくつかのステップがあります (図 1)。

source: The backend comprises several components of which some of them can be deployed in multiple instances to scale the system with increasing requirements.
ja: バックエンドは、複数のコンポーネントで構成されており、それらの中には、増加する要件にシステムを対応させられるように、複数のインスタンスにデプロイできるものがあります。

source: Create a set of data exchange standards to enable companies and organizations to share license and component information (metadata) for software packages and related content with the aim of facilitating license and other policy compliance.
ja: 企業や組織が、ソフトウェア パッケージと関連コンテンツのライセンスやコンポーネント情報 (メタデータ) を共有できるように、一連のデータ交換標準規格を作成することにより、ライセンスやその他のポリシー コンプライアンスを促進する。

source: - Perform code inspections as part of the pre-distribution verification to ensure that FOSS license, copyright notices have been intact, and that engineers have updated the change logs to reflect the changes introduced to the source code
ja: - 配布前の検証処理の一環としてコード検査を実行し、FOSS ライセンスや著作権告知に問題がないこと、および技術者が変更記録を更新し、ソース コードに加えられた改変を反映していることを確認します。

source: Back to Basics: Learn Computer Architecture
ja: 基本に帰る: コンピューター アーキテクチャを学習する

source: their licensing goals and obligations
ja: そのライセンスの目的と義務

source: Recorded online training is planned for 2011.
ja: 録画によるオンライン トレーニングも準備中です。

source: LF281 Executive Review of Open Source Compliance
ja: LF281 オープン ソース コンプライアンスのエグゼクティブ レビュー

source: The author would like to express his gratitude to Karen Copenhaver (Legal Director of the Linux Foundation and Partner in Choate, Hall & Stewart LLP 's Business & Technology practice) and Eben Moglen (Professor of Law and Legal History at Columbia University Law School and Chairman of the Software Freedom Law Center) for their reviews and valuable input.
ja: このホワイトベーパーの作成にあたっては、Karen Copenhaver 氏 (Linux Foundation のリーガル ディレクター兼 Choate, Hall & Stewart LLP 社 Business & Technology practice 所属のパートナー)、ならびに Eben Moglen 氏 (コロンビア大学ロースクールの Law and Legal History 教授兼 Software Freedom Law Center 議長) から貴重なレビューやアドバイスをいただきました。ありがとうございました。

source: The SPDX(TM) spec defines a way to specify manual/visual review of code (who, when), or
ja: SPDX(TM) 仕様は、手動による、あるいは視覚的なレビュー (誰が、いつ) の実績を表現する方法を定義しています。

source: Results of the mythtv license discovery (truncated)
ja: mythtv ライセンス検出の結果 (一部分)

source: The organization satisfies obligations in a consistent and disciplined manner.
ja: 組織は、一貫した規律ある方法で義務を履行する。

source: Process Adherence Audits refer to the checks the organization performs to determine whether it is using its defined compliance process and obtaining expected results from its use.
ja: 「プロセス順守の監査」は、組織がチェックした項目を参照し、定義されたコンプライアンス プロセスを利用しているか、および、その利用により、期待した結果が得られているかを確認します。

source: In preparation for the legal review, in addition to the source code audit report generated by the scanning tool, it is recommended to provide attorneys with all information discovered on the licensing of the specific component:
ja: 法務検査に備えて、スキャン ツールが生成したソース コード監査レポートだけでなく、そのコンポーネントのライセンスに関する全情報を弁護士に提供することをお勧めします。

source: Duration
ja: 期間

source: OBS integrates a lot of functionality that is not typically found in a more traditional build system.
ja: 従来のビルド システムに比べ、OBS には、さまざまな機能が統合されています。

source: Following this method, the notice file companies need to publish will always be up-to-date and will include lists of all FOSS, license information, copyright and attributions notices.
ja: こうすることにより、企業が公開する必要のある告知ファイルは、常に最新で、すべての FOSS のリスト、ライセンス情報、著作権告知、および帰属告知を含むようになります。

source: If sources have changed or build jobs have completed the scheduler receives an event that triggers the recalculation of the dependencies.
ja: ソースが変更されるか、ビルド ジョブが完了すると、スケジューラーは、依存関係の再計算をトリガーするイベントを受け取ります。

source: Description
ja: 概要

source: Training
ja: トレーニング

source: From the start, the SPDX(TM) standard Working Group set an ambitious goal - to have a defined format for a file of license fact information - in place by Q4 2010.
ja: 当初より、SPDX(TM) ワーキング グループは、2010 年の第 4 四半期までに、ライセンス情報のファイルに関するフォーマットを定義するという大きな目標を掲げました。

source: However, a major deviation – even a single one – could be fatal to certification.)
ja: ただし、大きな偏差は、たとえ 1 つしかなくても、認定を阻む可能性があります。）◆◆
